# Taps
# tap "jesseduffield/lazydocker"
# tap "jesseduffield/lazynpm"

# Shell / terminal workflow
brew "fzf"
brew "tmux"
brew "zoxide"
# brew "zsh-syntax-highlighting"

# Core CLI utilities
brew "jq"
brew "wget"
brew "poppler"
brew "nmap"

# Git / GitHub
brew "gh"
brew "lazygit"
# brew "git-delta"
# brew "git-lfs"

# Editors / file managers
brew "neovim"
brew "yazi"
# brew "vifm"
# brew "bat"

# JavaScript / Node
brew "pnpm"
brew "nvm"
brew "watchman"
brew "http-server"
# brew "jesseduffield/lazynpm/lazynpm"

# Rust
brew "rust"
brew "rust-analyzer"

# Mobile / iOS / Android
brew "cocoapods"
brew "fastlane"
brew "bundletool"

# Databases / backend services
# brew "postgresql@18", link: true
# brew "lazysql"

# Containers / process orchestration
# brew "lazydocker"
# brew "overmind"

# AI assistants
brew "opencode"

# Experiments / maybe later
# brew "television"
# brew "worktrunk"
